{
  "react": {
    "title": "React",
    "post": [
      {
        "id": 1,
        "title": "Getting Started with React: A Beginner's Guide",
        "description": "Learn the fundamentals of React in this comprehensive guide for beginners. We'll cover component creation, state management, and how to build your first React application from scratch.",
        "date": "2023-10-01",
        "contents": "## Introduction to React\n\nReact is a JavaScript library for building user interfaces. This guide will help you understand the core concepts of React, including components, props, and state.\n\n### Setting Up Your Environment\n\nBefore we start, make sure you have [Node.js](https://nodejs.org/) installed. You can create a new React app using Create React App:\n\n```bash\nnpx create-react-app my-first-app\ncd my-first-app\nnpm start\n```\n\n### Your First Component\n\nHere's a simple React component:\n\n```jsx\nfunction Welcome() {\n  return <h1>Hello, React Developer!</h1>;\n}\n\nexport default Welcome;\n```\n\n> **Pro tip:** Components are the building blocks of React applications. They let you split the UI into independent, reusable pieces.\n\n### Managing State\n\nState allows React components to change their output over time in response to user actions, network responses, and anything else.\n\n![React State Flow Diagram](/images/state-flow.png)\n\nWe'll walk through more advanced concepts in the following sections."
      },
      {
        "id": 2,
        "title": "Understanding React Hooks: useState and useEffect",
        "description": "Dive deep into React Hooks and discover how they revolutionize state management in functional components. This post explains how to use useState and useEffect with practical examples and best practices.",
        "date": "2023-10-15",
        "contents": "React Hooks were introduced in React 16.8 and have changed how we handle state and side effects in functional components. This article explores useState for state management and useEffect for handling lifecycle events with practical code examples."
      },
      {
        "id": 3,
        "title": "Building Responsive UIs with React and CSS",
        "description": "Explore techniques for creating beautiful, responsive user interfaces using React combined with modern CSS approaches. Learn about styled-components, CSS modules, and responsive design patterns for React applications.",
        "date": "2023-10-22",
        "contents": "Creating responsive user interfaces is essential for modern web applications. This post covers different styling approaches in React, from CSS modules to styled-components, and demonstrates how to implement responsive design patterns that work across devices."
      },
      {
        "id": 4,
        "title": "Advanced React Patterns: Context API and Reducers",
        "description": "Take your React skills to the next level by mastering the Context API and reducer patterns. This tutorial demonstrates how to manage global state efficiently without reaching for external libraries.",
        "date": "2023-11-05",
        "contents": "Managing state across components can be challenging. This article explains how to use React's Context API together with reducers to implement a Redux-like state management system without additional dependencies. We'll build a practical example to demonstrate these patterns."
      },
      {
        "id": 5,
        "title": "React Performance Optimization Techniques",
        "description": "Learn how to identify and fix performance bottlenecks in your React applications. This post covers memo, useMemo, useCallback, and other optimization strategies to make your React apps lightning fast.",
        "date": "2023-11-18",
        "contents": "Performance optimization is crucial for complex React applications. This deep dive covers techniques like component memoization, callback optimization, and code splitting to improve your app's speed and responsiveness. We'll use performance profiling tools to measure improvements."
      },
      {
        "id": 6,
        "title": "Server-Side Rendering with React and Next.js",
        "description": "Discover the benefits of server-side rendering and how to implement it using Next.js with React. This comprehensive guide covers routing, data fetching, and deployment strategies for SSR applications.",
        "date": "2023-12-01",
        "contents": "Next.js simplifies server-side rendering with React, improving performance and SEO. This guide explains how to set up a Next.js project, implement dynamic routing, fetch data on the server, and deploy your application to production environments."
      },
      {
        "id": 7,
        "title": "Testing React Applications: Best Practices and Tools",
        "description": "Testing is crucial for maintaining high-quality React applications. This post explores popular testing libraries like Jest and React Testing Library, along with best practices for writing effective tests.",
        "date": "2023-12-15",
        "contents": "A comprehensive testing strategy is essential for React applications. This post covers unit testing components with Jest and React Testing Library, writing integration tests, and implementing test-driven development workflows in your React projects."
      },
      {
        "id": 8,
        "title": "React and TypeScript: A Perfect Match",
        "description": "Learn how to leverage TypeScript in your React projects to improve type safety and developer experience. This post covers setting up TypeScript with React, common patterns, and tips for success.",
        "date": "2024-01-01",
        "contents": "TypeScript enhances the React development experience by adding static type checking. This guide shows how to set up TypeScript in React projects, create type-safe components, and use advanced TypeScript features with hooks and contexts for more robust applications."
      },
      {
        "id": 9,
        "title": "State Management in React: Redux vs. Context API",
        "description": "Explore the differences between Redux and the Context API for state management in React applications. This post provides insights into when to use each approach and practical examples.",
        "date": "2024-01-15",
        "contents": "Choosing the right state management solution is critical for React applications. This comparison examines Redux and Context API, explaining their strengths, weaknesses, and ideal use cases. We'll implement the same feature using both approaches to highlight differences."
      },
      {
        "id": 10,
        "title": "Building Progressive Web Apps with React",
        "description": "Learn how to create Progressive Web Apps (PWAs) using React. This post covers service workers, offline capabilities, and best practices for building fast, reliable web applications.",
        "date": "2024-02-01",
        "contents": "Progressive Web Apps provide native-like experiences on the web. This tutorial shows how to transform your React application into a PWA with service workers for offline functionality, implementing caching strategies, and adding the ability to install your app on devices."
      },
      {
        "id": 11,
        "title": "React Router: Navigating Your React Applications",
        "description": "Master React Router for seamless navigation in your React applications. This post covers routing concepts, nested routes, and dynamic routing with practical examples.",
        "date": "2024-02-15",
        "contents": "React Router enables powerful client-side routing in your applications. This guide covers setting up React Router, creating navigation layouts, implementing protected routes, and handling route parameters for dynamic content rendering."
      },
      {
        "id": 12,
        "title": "React Native: Building Mobile Apps with React",
        "description": "Discover how to build mobile applications using React Native. This post covers the differences between React and React Native, setting up your environment, and building your first mobile app.",
        "date": "2024-03-01",
        "contents": "React Native allows you to build native mobile apps using React concepts. This introduction explores the React Native ecosystem, explains environment setup for iOS and Android development, and walks through creating a simple cross-platform mobile application."
      }
    ]
  },
  "typescript": {
    "title": "TypeScript",
    "post": [
      {
        "id": 1,
        "title": "배열 타입, 튜플 타입",
        "description": "Array, Tuple types in TypeScript.",
        "date": "2025-04-07",
        "contents": "## 배열 타입\n\n배열 타입은 여러 개의 값을 저장할 수 있는 데이터 구조입니다. TypeScript에서는 배열을 정의할 때 다음과 같은 문법을 사용합니다.\n\n```typescript\n// 타입[]\nconst arr: {name: string, date: number}[] = [\n  {name: 'kim', date: 0801},\n  {name: 'lee', date: 0802},\n  {name: 'park', date: 0803}\n];\n\n// Array<타입>\nconst arr: Array<{name: string, date: number}> = [\n  {name: 'kim', date: 0801},\n  {name: 'lee', date: 0802},\n  {name: 'park', date: 0803}\n]; \n```\n\n## 튜플 타입\n\n튜플은 고정된 길이와 각 요소의 타입이 다른 배열입니다. TypeScript에서는 튜플을 다음과 같이 정의합니다.\n\n```typescript\n// 원소의 개수만큼 타입정의\nconst tuple: [string, number] = [\"park\", 1108];\n\n// 매개변수가 여러개일때 유용\nconst test = (id: number, user: [string, number]) => {\n  console.log(id, ...user);\n}\n\n// 튜플을 리턴하는 함수\nconst fetchData = (): [string, number] => {\n  return [\"lee\", 0803];\n}\n\n// 구조분해할당 가능\nconst [name, date] = fetchData();\n```\n\n> **Pro tip:** 튜플은 고정된 길이와 각 요소의 타입이 다를 때 유용하게 사용됩니다."
      },
      {
        "id": 2,
        "title": "TypeScript의 Interface와 Type 비교",
        "description": "TypeScript에서 타입을 정의하는 두 가지 주요 방법인 `interface`와 `type`의 차이점",
        "date": "2025-04-07",
        "contents": "## 1. 확장 (상속)\n\n두 방식 모두 확장이 가능하지만 문법에 차이가 있습니다.\n\n```typescript\n// interface는 extends 키워드 사용\ninterface Animal { \n  name: string; \n} \n\ninterface Dog extends Animal { \n  breed: string; \n}\n\n// type은 & 연산자 사용 \ntype Animal = { \n  name: string \n}; \n\ntype Dog = Animal & { \n  breed: string \n};\n```\n\n## 2. 선언 병합 (Declaration Merging)\n\n```typescript\n// interface는 동일 이름으로 여러 번 선언하면 자동으로 병합\ninterface Person { \n  name: string; \n} \n\ninterface Person { \n  age: number; \n}\n```\n\n결과적으로 Person은 `{ name: string; age: number }` 타입이 됩니다.\n\ntype은 이름 중복 선언이 불가능합니다:\n\n```typescript\ntype User = { name: string };\n// 아래 코드는 오류 발생\n// type User = { age: number }; // Error: Duplicate identifier 'User'\n```\n\n## 3. 유니언/교차 타입 가능 여부\n\n```typescript\n// type은 기본 타입과 유니언/교차 타입을 쉽게 조합 가능\ntype Status = \"success\" | \"error\";  // 가능\ntype Info = { name: string } | { age: number };  // 가능\n\n// interface는 유니언 타입을 직접 표현 불가\n// interface Status = \"success\" | \"error\";  // 오류 발생\n```\n\n## 4. 함수 타입 정의\n\n```typescript\n// type은 함수 타입 정의가 직관적\ntype Greet = (name: string) => string;  // 간결한 문법\n\n// interface도 가능하지만 문법이 덜 직관적\ninterface Greet { \n  (name: string): string;\n}\n```\n\n## 결론\n\n* 대부분의 **객체 타입 정의**에는 `interface`를 써도 충분합니다.\n* **복잡한 타입 조합(유니언, 튜플, 함수 타입 등)** 이 필요하면 `type`이 더 유연합니다.\n* **객체 지향 프로그래밍** 스타일을 선호한다면 `interface`가 적합합니다.\n* **함수형 프로그래밍**이나 **복잡한 타입 조합**이 필요하면 `type`이 유리합니다.\n* 실제 프로젝트에서는 두 가지를 상황에 맞게 혼용하는 경우가 많습니다."
      },
      {
        "id": 3,
        "title": "TypeScript",
        "description": "TypeScript is a superset of JavaScript that adds static typing to the language. It helps developers catch errors early in the development process and provides better tooling and IDE support. TypeScript is widely used in large codebases and is the preferred language for many modern web applications.",
        "date": "2023-10-01",
        "contents": "This guide covers integrating TypeScript with popular frameworks and libraries. We'll look at best practices for using TypeScript with React, Vue, Express, and other JavaScript ecosystems, including configuration tips and common patterns."
      },
      {
        "id": 4,
        "title": "TypeScript",
        "description": "TypeScript is a superset of JavaScript that adds static typing to the language. It helps developers catch errors early in the development process and provides better tooling and IDE support. TypeScript is widely used in large codebases and is the preferred language for many modern web applications.",
        "date": "2023-10-01",
        "contents": "Discover how to migrate existing JavaScript projects to TypeScript incrementally. This post provides a step-by-step approach to introduce TypeScript into legacy codebases while maintaining compatibility and minimizing disruption to development workflows."
      }
    ]
  },
  "setting": {
    "title": "Setting",
    "post": [
      {
        "id": 1,
        "title": "Setting",
        "description": "Setting is a crucial aspect of any application. It allows users to customize their experience and configure the application to suit their needs. Properly designed settings can greatly enhance user satisfaction and usability.",
        "date": "2023-10-01",
        "contents": "This article explores principles of effective settings design in modern applications. We'll discuss organizing settings logically, providing sensible defaults, and creating intuitive interfaces for configuration options to enhance user experience."
      },
      {
        "id": 2,
        "title": "Setting",
        "description": "Setting is a crucial aspect of any application. It allows users to customize their experience and configure the application to suit their needs. Properly designed settings can greatly enhance user satisfaction and usability.",
        "date": "2023-10-01",
        "contents": "Learn about implementing advanced settings features including user preference synchronization, environment-specific configurations, and accessibility options. This guide covers technical approaches to storing and managing application settings effectively."
      }
    ]
  }
}
